
package ua.khpi.oop.Hrianyk01;
/**
 * 
 * 	\author Heorhii Hrianyk
 * 	\version 1.0
 * 	\date septemer 2020 года
 * 	\warning Данный класс создан тільки для начальних цілей
 *
 * Завдання:
 *1.Обрати тип змінних та встановити за допомогою констант та літералів початкові значення:
 * .число, що відповідає номеру залікової книжки за допомогою шістнадцяткового літералу;
 * .число, що відповідає номеру мобільного телефона (починаючи з 380...) за допомогою десяткового літералу;
 * .число, яке складається з останніх двох ненульових цифр номера мобільного телефону за допомогою двійкового літералу;
 * .число, яке складається з останніх чотирьох ненульових цифр номера мобільного телефону за допомогою вісімкового літералу;
 * .визначити збільшене на одиницю значення залишку від ділення на 26 зменшеного на одиницю номера студента в журналі групи;
 * .символ англійського алфавіту в верхньому регістрі, номер якого відповідає знайденому раніше значенню.

 * 2.Використовуючи десятковий запис цілочисельного значення кожної змінної знайти і підрахувати кількість парних і непарних цифр.

 * 3.Використовуючи двійковий запис цілочисельного значення кожної змінної підрахувати кількість одиниць.
 */


public final class Hrianyk_Heorhii_01 {
	
	
    private static int a = 0x6;///номер в журналі
    private static int b = 993770442;///номер телефону
    private static int c = 0b1001010;///число, яке складається з останніх двох ненульових цифр номера мобільного телефону за допомогою двійкового літералу
    private static int d = 016422;///число, яке складається з останніх чотирьох ненульових цифр номера мобільного телефону за допомогою вісімкового літерал
    private static int e = (a - 1) % 26 + 1;///збільшене на одиницю значення залишку від ділення на 26 зменшеного на одиницю номера студента в журналі
    private static char s=(char)(e + 64);///
       

    public static void main(final String[] args)///main функція
    
    {
    	
    	
         PrintNumber();///вивести числа
         Para(a);///перевірка на парність
         Para(b);///перевірка на парність
         Para(c);///перевірка на парність
         Para(d);///перевірка на парність
         Para(e);///перевірка на парність
         Para((int)s);///перевірка на парність
         
         

         NumbeOfUnits(Integer.toBinaryString(a));///Двійковий запис цілочисельного значення кожної змінної кількість одиниць
         NumbeOfUnits(Integer.toBinaryString(b));///Двійковий запис цілочисельного значення кожної змінної кількість одиниць
         NumbeOfUnits(Integer.toBinaryString(c));///Двійковий запис цілочисельного значення кожної змінної кількість одиниць
         NumbeOfUnits(Integer.toBinaryString(d));///Двійковий запис цілочисельного значення кожної змінної кількість одиниць
         NumbeOfUnits(Integer.toBinaryString(e));///Двійковий запис цілочисельного значення кожної змінної кількість одиниць
         NumbeOfUnits(Integer.toBinaryString(s));///Двійковий запис цілочисельного значення кожної змінної кількість одиниць
    }

    public static void PrintNumber() {///вивести числа
        System.out.println("\nчисло, що відповідає номеру залікової книжки за допомогою шістнадцяткового літералу: " +  Integer.toHexString(a)
        		+ "\nчисло, що відповідає номеру мобільного телефона (починаючи з 380...) за допомогою десяткового літералу: " + b
        		+ "\nчисло, яке складається з останніх двох ненульових цифр номера мобільного телефону за допомогою двійкового літералу: " + Integer.toBinaryString(c) 
        		+ "\nчисло, яке складається з останніх чотирьох ненульових цифр номера мобільного телефону за допомогою вісімкового літералу:" + Integer.toOctalString(d)
        		+"\nзбільшене на одиницю значення залишку від ділення на 26 зменшеного на одиницю номера студента в журналі групи: " + e
        		+"\nсимвол англійського алфавіту в верхньому регістрі, номер якого відповідає знайденому раніше значенню: "+s);
    }

    static void Para(int p) ///перевірка на парність
    {
        int parni = 0;
        int neparni = 0;


        for(int temp = p; temp != 0; temp /= 10) {
            if (temp % 2 == 0) {
                ++parni;
            } else {
                ++neparni;
            }
        }

        System.out.println("\nВикористовуючи десятковий запис цілочисельного значення кожної змінної знайти  кількість парних і непарних цифр:\nпарних: " + parni + "\nнепарних: " + neparni + "\nЧисло: " + p);
    }

    public static void NumbeOfUnits(String str )///Двійковий запис цілочисельного значення кожної змінної кількість одиниць
    {

        int count = 0;
        for(int  i = 0;i<str.length();i++) {
        	char ch1 = str.charAt(i);
            if (ch1 == '1') {
               ++count;
          }
      }

        System.out.println("\nДвійковий запис цілочисельного значення кожної змінної кількість одиниць: " + count + "\nЧисло у двійкові системі: " + str);
    }
}